[
    "vorziehen = to prefer: ziehen Sie Kaffee oder Tee vor?; Ich ziehe ihn seinem Bruder vor; ein gutes Buch ziehe ich jedem Film vor.",
    "gebraucht = second hand, used: gebrauchte Bücher/Autos/Möbel (ver)kaufen",
    "der Spitzname, n = nickname: Wer kommt aus Wien und kennt ein Mädel, rothaarig, Spitzname “Karotte”?; Wie ist dein Spitzname?; mein Spitzname in der Nachbarschaft ist “Gärtner Pötschke”, ich muss ihm dieses Jahr mal wieder gerecht werden.",
    "zugefroren = frozen: die Donau ist zugefroren; in den letzten 50 Jahren ist die Donau nur 3 oder 4 Mal zugefroren; der See ist zugefroren; die Frontscheibe von Auto ist von innen zugefroren; Achtung! Der See ist nicht dick genug zugefroren!",
    "der Feinschmecker, / = gourmet, a person who likes to eat fine food and drink fine drinks.",
    "das Büffet = buffet (when there are no regular meal courses, but everything the guests could eat is set on one or two tables, this is typical for some hotels).",
    "vorspulen (! without Umlaut) = (to press the) fast-forward (button),  zurückspulen = rewind",
    "mitschreiben = to take notes while somebody else is talking: jemand ruft an und will etwas Wichtiges sagen. Du nimmst einen Stift, um es mitzuschreiben; auch so: Studenten schreiben den Vortrag mit. Synonym ist: Notizen machen, but you can use this other expression also when nobody is talking at the same time…",
    "igitt! = yuck! (an exclamation of disgust in regards to an offensive odor, taste, sight, or thought)",
    "puzzeln / ein Puzzle zusammensetzen = to do a jigsaw puzzle",
    "die Fangfrage = trick question: ist das jetzt eine Fangfrage?",
    "(ist) gebongt = OK: sehen wir uns heute um 5? – Gebongt!",
    "aufgeschlossen (offen) = outgoing; openminded: er war an diesem Abend heiter und aufgeschlossen (zugänglich); einem Problem aufgeschlossen gegenüberstehen; antonym: verschlossen",
    "die Wahlen = elections (example: die Wahlen in den USA)",
    "der Stimmzettel = voting paper (ballot) (example: ich gebe meinen Stimmzettel ab.)",
    "das Wahllokal = place where you go to vote (polling station) (example: das Wahllokal ist geschlossen.)",
    "die Wahlurne = ballot box (an die Wahlurne gehen = to vote)",
    "gesprächig = talkative, chatty: sie ist gesprächig (she loves to talk). Antonym: wortkarg = taciturn",
    "// <![CDATA[ kofiwidget2.init('Buy Me a Coffee', '#46b798', 'A780E3F');kofiwidget2.draw(); // ]]&gt;",
    "den Tisch decken und abräumen = to set the table (before eating) and to clear it (after eating)",
    "deklarieren = to declare:  haben Sie etwas zu deklarieren/verzollen?; den Kaffee beim Grenzübertritt deklarieren",
    "die Uhr umstellen = to adjust the clock: in 5 Tagen sollen wir unsere Uhren auf Winterzeit umstellen; die Uhr eine Stunde zurückstellen/vorstellen",
    "der, die, das Dings = that thing: gib mir mal das Dings da!; sie fahren im Urlaub immer nach Dings, ich weiß den Namen nicht mehr.",
    "das Ringelspiel (in Austria), das Karussel (in Germany)",
    "der Schlaumeier  / Besserwisser = wise guy, someone who wants to make an impression that he knows everything, an obnoxious know-it-all (in every day language); pejorative: der Klugscheißer (wise ass)",
    "durchbrennen = to run away: Sie hat ihn betrogen und ist mit einem anderen Mann durchgebrannt.",
    "aufrunden = to bring up to a round figure: eine Summe [von 9,60 auf 10 Euro] aufrunden",
    "verkehrt herum = upside down: das Buch steht verkehrt herum im Regal; einen Pullover verkehrt herum anziehen",
    "qualitativ hochwertig = high-quality: die Firma bietet qualitativ hochwertige Produkte zu günstigen Preisen an.",
    "zunehmen = to gain weight, abnehmen = to lose weight: ich hab’ 5 Kilo zugenommen! Ich muss unbedingt abnehmen!",
    "hochladen = to upload; runterladen = to download (ich habe diese Datei hochgeladen/runtergeladen)",
    "rangehen (for example: geh ran!) = to pick up (answer) the phone; auflegen (er wollte noch etwas sagen, aber sie hat schon aufgelegt) = to hang up",
    "der Quereinsteiger, / = career changer. That is a person who makes a carrier in a field that is not his/her primary field. For example, great managers in large companies are “Quereinsteiger”.",
    "ausrutschen = to slip (auf einem nassen und glatten Boden ausrutschen und hinfallen)",
    "die Goldgräberin = gold digger (woman who is looking for a rich man)",
    "hochgeschoben -> die Brille (example: Alessandra Abrosio trägt die Sonnenbrille lässig auf den Kopf hochgeschoben)",
    "den Kaffee aufsetzen (to put on) = auf den Herd stellen (examples: Kaffee, Tee, Milch, das Essen, einen Topf mit Kartoffeln aufsetzen)",
    "aufsteigen = er ist auf das Fahrrad aufgestiegen; absteigen = sie ist vom Fahrrad abgestiegen.",
    "die Garderobe = place where you hang your clothes (example: Hut und Mantel an die Garderobe hängen)",
    "das Kleingeld = very small amount of money (mostly Münzen); das Wechselgeld = change (money that you get after you pay for something); klein machen => können Sie mir bitte diesen 100-EUR-Schein klein machen?",
    "einladen = to ask out (example: er hat sie eingeladen.)",
    "der Geisterfahrer, / = driver that is driving in wrong direction on the highway or on any other street. This situation is extremely dangerous and can cause severe damage. And yes, it is a very common German word. You can hear warnings in the news almost on a daily basis.",
    "der Streunerhund, e = stray dog; synonym: Straßenhund = street dog",
    "der Morgenmuffel = person who doesn’t like to get up early and is grumpy in the morning (example: Ich bin ein Morgenmuffel.)",
    "der Bandwurm = tapeworm (example: ich habe einen Bandwurm. Deshalb esse ich Eis. Ich will ihn dadurch erfrieren lassen.)",
    "das Kaff (slang, pejorative) = a boring place where nothing happens and where no one wants to live",
    "durchstöbern = to comb through, to browse something: er hat den Laden (nach einem Geschenk) durchtöbert",
    "das Guthaben, / =credit; example: das Guthaben fürs Internet, fürs Handy (prepaid)",
    "die Selbstgedrehte, n (self made cigarette): er raucht Selbstgedrehte (he smokes self rolled cigarettes)."
]
